anthropic.claude-code
charliermarsh.ruff
dunstontc.viml
earshinov.permute-lines
github.copilot-chat
gruntfuggly.todo-tree
ibm.output-colorizer
james-yu.latex-workshop
johnpapa.vscode-peacock
monokai.theme-monokai-pro-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.sublime-keybindings
njpwerner.autodocstring
openai.chatgpt
redhat.vscode-yaml
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
